bit-finance/Catalogs/бит_ПользовательскиеВыборыВарианта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ПользовательскиеВыборыВарианта</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодВычисленияВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеТипаЗначенийВариантов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыСистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСистемы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВычисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Catalogs/бит_ПользовательскиеВыборыВарианта/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Вычисляет значение пользовательского варианта.
// 
// Параметры:
//  ПользовательскийВыборВарианта  - СправочникСсылка.бит_ПользовательскиеВыборыВарианта.
//  СтруктураКонтекст        - Структура.
// 
// Возвращаемое значение:
//  Значение - Произвольное.
// 
Функция ЗначениеПользовательскогоВарианта(ПользовательскийВыборВарианта
	                                      , СтруктураКонтекст) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	КодВычисленияВарианта = "";
	ПараметрыВычисления   = Новый Структура;
	
	Если ТипЗнч(ПользовательскийВыборВарианта) = Тип("СправочникСсылка.бит_ПользовательскиеВыборыВарианта") Тогда
		РеквизитыВыбораВарианта = "КодВычисленияВарианта, ПараметрыВычисления";
		ЗначенияРеквизитов      = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПользовательскийВыборВарианта,
																			РеквизитыВыбораВарианта);
		КодВычисленияВарианта   = ЗначенияРеквизитов.КодВычисленияВарианта;
		
		ВыборкаПараметров       = ЗначенияРеквизитов.ПараметрыВычисления.Выбрать();
		Пока ВыборкаПараметров.Следующий() Цикл
			ПараметрыВычисления.Вставить(ВыборкаПараметров.ИмяПараметра, ВыборкаПараметров.ЗначениеПараметра);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ПользовательскийВыборВарианта) = Тип("СправочникОбъект.бит_ПользовательскиеВыборыВарианта") Тогда
		КодВычисленияВарианта   = ПользовательскийВыборВарианта.КодВычисленияВарианта;
		Для каждого СтрокаПараметра Из ПользовательскийВыборВарианта.ПараметрыВычисления Цикл
			ПараметрыВычисления.Вставить(СтрокаПараметра.ИмяПараметра, СтрокаПараметра.ЗначениеПараметра);
		КонецЦикла;
	КонецЕсли;
	
	Если ПустаяСтрока(КодВычисленияВарианта) Тогда
		Возврат Неопределено;
	КонецЕсли;                 	
	
	СтатусОбъекта = бит_ВизированиеСервер.ТекущийСтатус(СтруктураКонтекст.ТекущийОбъект.Ссылка);
	
	ПараметрыВычисленияВарианта = Новый Структура;
	ПараметрыВычисленияВарианта.Вставить("ВыборВарианта",         ПользовательскийВыборВарианта);
	ПараметрыВычисленияВарианта.Вставить("КодВычисленияВарианта", КодВычисленияВарианта);
	ПараметрыВычисленияВарианта.Вставить("ПараметрыВычисления",   ПараметрыВычисления);
	ПараметрыВычисленияВарианта.Вставить("ТекущийОбъект",         СтруктураКонтекст.ТекущийОбъект);
	ПараметрыВычисленияВарианта.Вставить("Статус",   			  СтатусОбъекта);
	ПараметрыВычисленияВарианта.Вставить("ТекущийПользователь",   Пользователи.ТекущийПользователь());
	ПараметрыВычисленияВарианта.Вставить("КонтекстВызова",        СтруктураКонтекст);
	
	Возврат РезультатВычисленияЗначенияВарианта(ПараметрыВычисленияВарианта);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатВычисленияЗначенияВарианта(Служебное_ПараметрыВычисленияВарианта)
	
	ТекущийОбъект     = Служебное_ПараметрыВычисленияВарианта.ТекущийОбъект;
	СтруктураКонтекст = Служебное_ПараметрыВычисленияВарианта.КонтекстВызова;
	ТекущийНаборВиз   = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураКонтекст, "НаборВизы");
	
	Дополнительно = Новый Структура;
	Дополнительно.Вставить("Статус",              Служебное_ПараметрыВычисленияВарианта.Статус);
	Дополнительно.Вставить("ТекущийПользователь", Служебное_ПараметрыВычисленияВарианта.ТекущийПользователь);
	
	ПараметрыВычисления = Служебное_ПараметрыВычисленияВарианта.ПараметрыВычисления;
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Неопределено;
	
	СлужебныеФункции = Новый Массив;
	СлужебныеФункции.Добавить("ДополнительноеСвойство");
	СлужебныеФункции.Добавить("ВсеВизыПолучены");
	СлужебныеФункции.Добавить("ПринятоРешение");
	СлужебныеФункции.Добавить("ПринятоРешениеПоВизе");
	СлужебныеФункции.Добавить("ПринятоРешениеПоВышестоящимВизам");
	СлужебныеФункции.Добавить("ПринятыРешенияПоВышестоящимВизам");
	
	КодВычисленияВарианта = Служебное_ПараметрыВычисленияВарианта.КодВычисленияВарианта;
	Для каждого СлужебнаяФункция Из СлужебныеФункции Цикл
		ПодстрокаПоиска = СлужебнаяФункция + "(";
		ПодстрокаЗамены = "Подключаемый_" + ПодстрокаПоиска;
		КодВычисленияВарианта = СтрЗаменить(КодВычисленияВарианта, ПодстрокаПоиска, ПодстрокаЗамены);
	КонецЦикла;
	
	Попытка			
		// АПК:488-выкл. ВыполнитьВБезопасномРежиме не используется, т.к. необходимо сохранить контекст вызова.
		Выполнить(КодВычисленияВарианта);
		// АПК:488-вкл.
	Исключение
		ВыборВарианта = Служебное_ПараметрыВычисленияВарианта.ВыборВарианта;
		ШаблонОшибки  = НСтр("ru = 'Ошибка вычисления варианта ""%1"". %2'; 
							|en = 'Variant calculation error ""%1"". %2'");
		ТекстОшибки   = СтрШаблон(ШаблонОшибки,
								ВыборВарианта,
								КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ВыборВарианта);
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
	
КонецФункции

Функция Подключаемый_ДополнительноеСвойство(ВладелецСвойства, ИмяСвойства)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК СвойствоОбъекта
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Имя = &ИмяСвойства";
	Запрос.УстановитьПараметр("ИмяСвойства", ИмяСвойства);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат УправлениеСвойствами.ЗначениеСвойства(ВладелецСвойства.Ссылка, Выборка.СвойствоОбъекта); 
	
КонецФункции

Функция Подключаемый_ВсеВизыПолучены(ТекущийОбъект)
	
	Возврат бит_ВизированиеСервер.ВизыПолучены(ТекущийОбъект);
	
КонецФункции

Функция Подключаемый_ПринятоРешение(ТекущийОбъект, Решение, ТекущийНаборВиз = Неопределено)
	
	Возврат бит_ВизированиеСервер.ПринятоРешение(ТекущийОбъект, Решение, ТекущийНаборВиз);
	
КонецФункции

Функция Подключаемый_ПринятоРешениеПоВизе(ТекущийОбъект, Виза, ТекущийНаборВиз = Неопределено)
	
	Возврат бит_ВизированиеСервер.ПринятоРешениеПоВизе(ТекущийОбъект, Виза, ТекущийНаборВиз);
	
КонецФункции

Функция Подключаемый_ПринятоРешениеПоВышестоящимВизам(ТекущийОбъект, Виза, Решение, ТекущийНаборВиз = Неопределено)
	
	Возврат бит_ВизированиеСервер.ПринятоРешениеПоВышестоящимВизам(ТекущийОбъект, Виза, Решение, ТекущийНаборВиз);
	
КонецФункции

Функция Подключаемый_ПринятыРешенияПоВышестоящимВизам(ТекущийОбъект, Виза, ТекущийНаборВиз = Неопределено)
	
	Возврат бит_ВизированиеСервер.ПринятыРешенияПоВышестоящимВизам(ТекущийОбъект, Виза, ТекущийНаборВиз);
	
КонецФункции

#КонецОбласти

#КонецЕсли
